import 'package:first_full_app/model/employee_model.dart';

class EmployeeRepo{
  List<EmployeeModel> getAllEmployeeList=[
    EmployeeModel(
        "জনাব সজীব ওয়াজেদ",
        "তথ্য ও যোগাযোগ প্রযুক্তি বিষয়ক উপদেষ্টা",
        "assets/image/im1.jpg",
        "+৮৮-০২-৪১০২৪০৩৮",
        "sajeeb.wazed@ictd.gov.bd",
        "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
        "একটি শক্তিশালী আইটি ইন্ডাস্ট্রি গড়ে তোলা, "
            "ই-গভর্ন্যান্স প্রবর্তন ও বৃহৎ পরিসরে আইটি"
            " শিক্ষা চালুর মাধ্যমে সরকারের ডিজিটাল"
            " বাংলাদেশ প্রকল্প বাস্তবায়নে একটি বিশদ "
            "ধারণাপত্র ও কর্মপরিকল্পনা উপস্থাপন করেন। "
            "তিনি ডিজিটাল বাংলাদেশ বিনির্মাণে প্রধান কারিগর"
            " হিসেবে কাজ করছেন"
    )
  , EmployeeModel
    ("জনাব জুনাইদ আহ্‌মেদ পলক",
      "মাননীয় প্রতিমন্ত্রী ",
      "assets/image/p1.jpg",
      "+৮৮-০২-৪১০২৪০৩৮",
      "palak@ictd.gov.bd",
      "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
        "একটি শক্তিশালী আইটি ইন্ডাস্ট্রি গড়ে তোলা, "
            "ই-গভর্ন্যান্স প্রবর্তন ও বৃহৎ পরিসরে আইটি"
            " শিক্ষা চালুর মাধ্যমে সরকারের ডিজিটাল"
            " বাংলাদেশ প্রকল্প বাস্তবায়নে একটি বিশদ "
            "ধারণাপত্র ও কর্মপরিকল্পনা উপস্থাপন করেন। "
            "তিনি ডিজিটাল বাংলাদেশ বিনির্মাণে প্রধান কারিগর"
            " হিসেবে কাজ করছেন"
    ),
  EmployeeModel
    ("মোঃ সাইফুল ইসলাম",
      "মাননীয় প্রতিমন্ত্রীর একান্ত সচিব ",
      "assets/image/p2.jpg",
      "+৮৮-০২-৪১০২৪০৩৯",
      "saifkhokon@ictd.gov.bd",
      "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
      "একটি শক্তিশালী আইটি ইন্ডাস্ট্রি গড়ে তোলা, "
          "ই-গভর্ন্যান্স প্রবর্তন ও বৃহৎ পরিসরে আইটি"
          " শিক্ষা চালুর মাধ্যমে সরকারের ডিজিটাল"
          " বাংলাদেশ প্রকল্প বাস্তবায়নে একটি বিশদ "
          "ধারণাপত্র ও কর্মপরিকল্পনা উপস্থাপন করেন। "
          "তিনি ডিজিটাল বাংলাদেশ বিনির্মাণে প্রধান কারিগর"
          " হিসেবে কাজ করছেন"
  ),
  EmployeeModel
    ("শহিদুল আলম মজুমদার",
      "তথ্য ও জনসংযোগ কর্মকর্তা",
      "assets/image/p3.jpg",
      "+৮৮-০২-৫৫০০৬৯০৪",
      "sa.majumder65@gmail.com",
      "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
      "একটি শক্তিশালী আইটি ইন্ডাস্ট্রি গড়ে তোলা, "
          "ই-গভর্ন্যান্স প্রবর্তন ও বৃহৎ পরিসরে আইটি"
          " শিক্ষা চালুর মাধ্যমে সরকারের ডিজিটাল"
          " বাংলাদেশ প্রকল্প বাস্তবায়নে একটি বিশদ "
          "ধারণাপত্র ও কর্মপরিকল্পনা উপস্থাপন করেন। "
          "তিনি ডিজিটাল বাংলাদেশ বিনির্মাণে প্রধান কারিগর"
          " হিসেবে কাজ করছেন"
  ),
    // EmployeeModel
    //   ("মোঃ সাইফুল ইসলাম",
    //     "মাননীয় প্রতিমন্ত্রীর একান্ত সচিব ",
    //     "assets/image/p2.jpg",
    //     "+৮৮-০২-৪১০২৪০৩৯",
    //     "saifkhokon@ictd.gov.bd",
    //     "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
    //     " "
    // ),
  ];
}