import 'package:first_full_app/model/employee_model.dart';

class EmployeeRepo{

  List<EmployeeModel> getSpecialList=[
  EmployeeModel(
  "মাননীয় শেখ হাসিনা",
  "প্রধানমন্ত্রী",
  "assets/image/prime.png",
  " ",
  " ",
  " ",
  '"বিশ্বের এই চরম সংকটময় সময়ে আমি অস্ত্র প্রতিযোগিতায় সম্পদ ব্যয় না করে তা সার্বজনীন টেকসই উন্নয়ন অর্জনে ব্যবহার করার আহ্বান জানাই। আসুন, আমরা সার্বজনীন শান্তির জন্য প্রতিজ্ঞাবদ্ধ হয়ে কর্মযজ্ঞে নেমে পরি"'
  ),
  EmployeeModel(
  "জনাব সজীব ওয়াজেদ",
  "তথ্য ও যোগাযোগ প্রযুক্তি বিষয়ক উপদেষ্টা",
  "assets/image/im1.jpg",
  "+৮৮-০২-৪১০২৪০৩৮",
  "sajeeb.wazed@ictd.gov.bd",
  "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
  '"বিজ্ঞান, প্রযুক্তি এবং উদ্ভাবন কীভাবে প্রবৃদ্ধি ও উন্নয়নকে চালিত করতে পারে তার একটি নিখুঁত উদাহরণ বাংলাদেশ"'
  ),
  EmployeeModel
  ("জনাব জুনাইদ আহ্‌মেদ পলক",
  "মাননীয় প্রতিমন্ত্রী ",
  "assets/image/p1.jpg",
  "+৮৮-০২-৪১০২৪০৩৮",
  "palak@ictd.gov.bd",
  "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
  " “ প্রযুক্তি শিক্ষায় শিক্ষিত এদেশের তরুণরাই একদিন বিশ্ব জয় করবে ” "
  ),];

  List<EmployeeModel> getAllEmployeeList=[

    EmployeeModel(
        "জনাব সজীব ওয়াজেদ",
        "তথ্য ও যোগাযোগ প্রযুক্তি বিষয়ক উপদেষ্টা",
        "assets/image/im1.jpg",
        "+৮৮-০২-৪১০২৪০৩৮",
        "sajeeb.wazed@ictd.gov.bd",
        "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
        ""
    ),
    EmployeeModel
    ("জনাব জুনাইদ আহ্‌মেদ পলক",
      "মাননীয় প্রতিমন্ত্রী ",
      "assets/image/p1.jpg",
      "+৮৮-০২-৪১০২৪০৩৮",
      "palak@ictd.gov.bd",
      "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
        ""
    ),
  EmployeeModel
    ("মোঃ সাইফুল ইসলাম",
      "মাননীয় প্রতিমন্ত্রীর একান্ত সচিব ",
      "assets/image/p2.jpg",
      "+৮৮-০২-৪১০২৪০৩৯",
      "saifkhokon@ictd.gov.bd",
      "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
      ""
  ),
  EmployeeModel
    ("শহিদুল আলম মজুমদার",
      "তথ্য ও জনসংযোগ কর্মকর্তা",
      "assets/image/p3.jpg",
      "+৮৮-০২-৫৫০০৬৯০৪",
      "sa.majumder65@gmail.com",
      "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
      ""
  ),
    EmployeeModel
      ("রনজিত কুমার",
        "মাননীয় প্রতিমন্ত্রীর সহকারী একান্ত সচিব",
        "assets/image/p4.jpg",
        "+৮৮-০১৭৩৭-২৪১১৪১",
        "ronjitaps.ictm@gmail.com",
        "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
        ""
    ),
    EmployeeModel
      ("একরামুল হক",
        "মাননীয় প্রতিমন্ত্রীর ব্যক্তিগত কর্মকর্তা",
        "assets/image/p5.jpg",
        "+৮৮-০১৯১৫৬৬০৩০৬",
        "ekramul.haque@ictd.gov.bd",
        "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
        ""
    ),
    EmployeeModel
      ("মোঃ রাকিবুল ইসলাম",
        "মাননীয় প্রতিমন্ত্রীর ব্যক্তিগত কর্মকর্তা",
        "assets/image/p6.jpg",
        "+৮৮-০১৭৫১১৫৫৬৭৮",
        "rakib.vision2021@gmail.com",
        "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
        " "
    ),
    EmployeeModel
      ("ছানোয়ার হোসেন",
        "ব্যক্তিগত কর্মকর্তা ",
        "assets/image/p7.jpg",
        "+৮৮-০১৭১৯৭৮৭৩৬৬",
        "sanowar.hossen@ictd.gov.bd",
        "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
        " "
    ),
    EmployeeModel
      ("আনোয়ার হোসেন",
        "মাননীয় প্রতিমন্ত্রীর ব্যক্তিগত সহকারী",
        "assets/image/p8.jpg",
        "+৮৮-০১৭১৯৯৬০৩৪৪",
        "anwar.hossain@ictd.gov.bd",
        "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
        " "
    ),
    EmployeeModel
      ("মোঃ চাঁন মিয়া",
        "ডাটা এন্ট্রি/কন্ট্রোল অপারেটর",
        "assets/image/p9.jpg",
        "+৮৮-০১৭৪০০৪৪৮১১",
        "mdchanmia019@gmail.com",
        "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
        " "
    ),
    // EmployeeModel
    //   ("মোঃ সাইফুল ইসলাম",
    //     "মাননীয় প্রতিমন্ত্রীর একান্ত সচিব ",
    //     "assets/image/p2.jpg",
    //     "+৮৮-০২-৪১০২৪০৩৯",
    //     "saifkhokon@ictd.gov.bd",
    //     "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ ",
    //     " "
    // ),
  ];
}