import 'package:first_full_app/model/question_model.dart';

class QuizRepo{

  List<QuestionModel> getQuestionModelList=[
  QuestionModel
    (
      "বাংলাদেশের রাজধানি কোনটা?",
      [ "বগুড়া","ফকিরহাট","বাগেরহাট","ঢাকা"],
      [0,0,0,1]
  ),

 QuestionModel
    (
      "পদ্মা সেতু কোন দু’টি জেলাকে সংযুক্ত করেছে?",
      [ "বগুড়া ও মুন্সীগঞ্জ","মুন্সীগঞ্জ ও শরীয়তপুর","বাগেরহাট ও ঢাকা","ঢাকা ও সরিয়তপুর"],
      [0,1,0,0]
  ),
  QuestionModel
    (
      "বাংলাদেশের সর্বাধিক চা বাগান কোন জেলায় অবস্থিতে?",
      [ "মৌলভীবাজার","মুন্সীগঞ্জ","শরীয়তপুর","ঢাকা"],
      [1,0,0,0]
  ),
  QuestionModel
    (
      "বাংলাদেশের পুলিশ মুক্তিযুদ্ধ জাদুঘর কোথায় অবস্থিত?",
      [ "রাজারবাগ, ঢাকা","গাবতলী, ঢাকা"," মাহবাগ, ঢাকা","জাহঙ্গীর নগর, ঢাকা",],
      [1,0,0,0]
  ),
  QuestionModel
    (
      "মুক্তিযুদ্ধের আত্মসমর্পণ দলিল কোথায় স্বাক্ষরিত হয়ে?",
      [ "রজারবাগ ময়দানে","রেসকোর্স ময়দানে","জাহঙ্গীর নগর ময়দানে","ঢাকা ময়দান"],
      [0,1,0,0]
  ),
  QuestionModel
    (
      "আয়তনে বাংলাদেশের সবচেয়ে বড় জেলা কোনটি?",
      [ "সিলেট","মুন্সীগঞ্জ","পার্বত্য রাঙামাটি","বগুড়া"],
      [0,0,1,0]
  ),
  QuestionModel
    (
      "বাংলাদেশের কোন জেলাটির নামকরণ করা হয়েছে একটি নদীর নাম অনুসারে",
      [ "সিলেট","মুন্সীগঞ্জ","ফেনীি","গোপালগঞ্জ"],
      [0,0,1,0]
  ),
  QuestionModel
    (
      "রাখাইন উপজাতিদের অধিক বাস কোন জেলায়",
      [ "মুন্সীগঞ্জ জেলায়","নেত্রকোণা জেলায়",
        "কক্সবাজার জেলায়","শেরপুর জেলায়"],
      [0,0,1,0]
  ),
  QuestionModel
    (
      "আয়তনের দিক থেকে বিশ্বে বাংলাদেশের অবস্থান কত তম",
      [ "৮০","৬০","৫০","৯০"],
      [0,0,0,1]
  ),
  QuestionModel
    (
      "বাংলাদেশের প্রথম নিরক্ষরতামুক্ত গ্রাম কোনটি",
      [ "মানিকগঞ্জ","গাজীপুর","কচুবাড়ির কৃষ্টপুর, ঠাকুরগাঁও","জামালপুর"],
      [0,0,1,0]
  )
  ];
}